#### FileFlow Terraform Plan 📋

**Environment**: Production
**Modules**: 4

<details><summary>📦 elasticache-redis</summary>

```terraform

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

</details>

<details><summary>📦 s3-bucket</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.s3_access will be created
  + resource "aws_cloudwatch_log_group" "s3_access" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ap-northeast-2:646886795421:key/de3fcbd6-a155-4245-bdeb-d626ef4038ce"
      + log_group_class   = (known after apply)
      + name              = "/aws/s3/fileflow-prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Component"   = "s3-logging"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "log-fileflow-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all          = {
          + "Component"   = "s3-logging"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "log-fileflow-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
    }

  # aws_kms_alias.s3 will be created
  + resource "aws_kms_alias" "s3" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/fileflow-prod"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "de3fcbd6-a155-4245-bdeb-d626ef4038ce"
    }

  # aws_kms_key.s3 will be updated in-place
  ~ resource "aws_kms_key" "s3" {
      ~ description                        = "KMS key for fileflow--prod S3 bucket" -> "KMS key for fileflow-prod S3 bucket"
        id                                 = "de3fcbd6-a155-4245-bdeb-d626ef4038ce"
        tags                               = {
            "Component"   = "s3-encryption"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "Name"        = "kms-fileflow-prod"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.main will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = "fileflow-prod"
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:ap-northeast-2:646886795421:key/de3fcbd6-a155-4245-bdeb-d626ef4038ce"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_ssm_parameter.kms_key_id will be updated in-place
  ~ resource "aws_ssm_parameter" "kms_key_id" {
        id          = "/fileflow/prod/s3/kms-key-id"
        name        = "/fileflow/prod/s3/kms-key-id"
      ~ tags        = {
            "Component"   = "parameter-store"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "ssm-fileflow--prod-kms" -> "ssm-fileflow-prod-kms"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
      ~ tags_all    = {
          ~ "Name"        = "ssm-fileflow--prod-kms" -> "ssm-fileflow-prod-kms"
            # (7 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

```

</details>

<details><summary>📦 sqs-queue</summary>

```terraform

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

</details>

<details><summary>📦 ecs-service</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role_policy.fileflow_ecr_access will be created
  + resource "aws_iam_role_policy" "fileflow_ecr_access" {
      + id          = (known after apply)
      + name        = "fileflow-prod-ecr-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "fileflow-prod-ecs-execution-role"
    }

  # aws_iam_role_policy.fileflow_secrets_access will be created
  + resource "aws_iam_role_policy" "fileflow_secrets_access" {
      + id          = (known after apply)
      + name        = "fileflow-prod-secrets-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:prod-shared-mysql-master-password-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/6ed5bf61-9e05-4bf0-ab5e-2233f3e57a1a"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "fileflow-prod-ecs-execution-role"
    }

  # module.fileflow_alb.aws_lb_target_group.this["fileflow"] will be updated in-place
  ~ resource "aws_lb_target_group" "this" {
        id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/fileflow-prod-alb-fileflow/0282974f4dcfd0de"
        name                               = "fileflow-prod-alb-fileflow"
        tags                               = {
            "Component"   = "load-balancer"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "Target group for fileflow-prod-alb - fileflow"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow-prod-alb-fileflow"
            "Owner"       = "platform-team@example.com"
            "Repository"  = "infrastructure"
            "Service"     = "fileflow"
        }
        # (17 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/actuator/health" -> "/health"
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.fileflow_service.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/fileflow-prod/fileflow"
        name                               = "fileflow"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for fileflow"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow"
            "Owner"       = "platform-team@example.com"
            "Repository"  = "infrastructure"
            "Service"     = "fileflow"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow:16" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fileflow_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "fileflow" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for fileflow"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow"
            "Owner"       = "platform-team@example.com"
            "Repository"  = "infrastructure"
            "Service"     = "fileflow"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

```

</details>


*Pushed by: @ryu-qqq, Action: `pull_request`*

---
**Next Steps:**
1. Review the Terraform plan above
2. Approve this PR if changes look correct
3. Merge to trigger deployment
